
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>07计算机系统启动过程分析 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="08yun-suan-qi-she-ji.html" />
    
    
    <link rel="prev" href="06ji-suan-ji-zong-xian-jie-kou-ji-zhu.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01yin-yan.html">
            
                <a href="01yin-yan.html">
            
                    
                    01引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02zhi-ling-xi-tong.html">
            
                <a href="02zhi-ling-xi-tong.html">
            
                    
                    02指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03te-quan-zhi-ling-xi-tong.html">
            
                <a href="03te-quan-zhi-ling-xi-tong.html">
            
                    
                    03特权指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04ruan-ying-jian-xie-tong.html">
            
                <a href="04ruan-ying-jian-xie-tong.html">
            
                    
                    04软硬件协同
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05ji-suan-ji-zu-cheng-yuan-li-he-jie-gou.html">
            
                <a href="05ji-suan-ji-zu-cheng-yuan-li-he-jie-gou.html">
            
                    
                    05计算机组成原理和结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06ji-suan-ji-zong-xian-jie-kou-ji-zhu.html">
            
                <a href="06ji-suan-ji-zong-xian-jie-kou-ji-zhu.html">
            
                    
                    06计算机总线接口技术
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="07ji-suan-ji-xi-tong-qi-dong-guo-cheng-fen-xi.html">
            
                <a href="07ji-suan-ji-xi-tong-qi-dong-guo-cheng-fen-xi.html">
            
                    
                    07计算机系统启动过程分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08yun-suan-qi-she-ji.html">
            
                <a href="08yun-suan-qi-she-ji.html">
            
                    
                    08运算器设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09zhi-ling-liu-shui-xian.html">
            
                <a href="09zhi-ling-liu-shui-xian.html">
            
                    
                    09指令流水线
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10bing-xing-bian-cheng-ji-chu.html">
            
                <a href="10bing-xing-bian-cheng-ji-chu.html">
            
                    
                    10并行编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11duo-he-chu-li-jie-gou.html">
            
                <a href="11duo-he-chu-li-jie-gou.html">
            
                    
                    11多核处理结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12ji-suan-ji-xing-neng-fen-xi.html">
            
                <a href="12ji-suan-ji-xing-neng-fen-xi.html">
            
                    
                    12计算机性能分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="zhong-dian-neng-li.html">
            
                <a href="zhong-dian-neng-li.html">
            
                    
                    重点能力
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >07计算机系统启动过程分析</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="07-&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x5206;&#x6790;">07 &#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x5206;&#x6790;</h1>
<h3 id="&#x5904;&#x7406;&#x5668;&#x6838;&#x521D;&#x59CB;&#x5316;">&#x5904;&#x7406;&#x5668;&#x6838;&#x521D;&#x59CB;&#x5316;</h3>
<ul>
<li>&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x4ECE;&#x54EA;&#x91CC;&#x53D6;&#x7684;&#xFF1F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x628A;&#x5185;&#x6838;&#x62F7;&#x8D1D;&#x5230;&#x5185;&#x5B58;&#xFF1F;</li>
</ul>
<p>&#x65E0;&#x8BBA;&#x91C7;&#x7528;&#x4F55;&#x79CD;&#x6307;&#x4EE4;&#x7CFB;&#x7EDF;&#x7684;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x590D;&#x4F4D;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x90FD;&#x4F1A;&#x4ECE;&#x4E00;&#x4E2A;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x7684;&#x7279;&#x5B9A;&#x5730;&#x5740;&#x53D6;&#x56DE;
&#x5BF9;&#x4E8E;LoongArch&#xFF0C;&#x5904;&#x7406;&#x5668;&#x590D;&#x4F4D;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x5C06;&#x56FA;&#x5B9A;&#x4ECE;&#x5730;&#x5740;0x1C000000 &#x7684;&#x4F4D;&#x7F6E;&#x83B7;&#x53D6;&#x3002;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x9700;&#x8981;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x7ED9;&#x5904;&#x7406;&#x5668;&#x6838;&#x63D0;&#x4F9B;&#x6307;&#x4EE4;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BBE;&#x5907;&#x4EE5;&#x524D;&#x662F;&#x5404;&#x79CD;ROM&#xFF0C;&#x73B0;&#x5728;&#x901A;&#x5E38;&#x662F;&#x95EA;&#x5B58;&#xFF08;Flash&#xFF09;</p>
<p>&#x5904;&#x7406;&#x5668;&#x7684;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x56FA;&#x4EF6;&#xFF0C;&#x53C8;&#x79F0;&#x4E3A;BIOS&#xFF08;&#x57FA;&#x672C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x7CFB;&#x7EDF;&#xFF09;&#x3010;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x5230;BIOS&#x3011;</p>
<p>BIOS&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x5B8C;&#x6210;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5C06;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x4ECE;&#x5185;&#x6838;&#x62F7;&#x8D1D;&#x5230;&#x5185;&#x5B58;</p>
<ul>
<li>&#x5904;&#x7406;&#x5668;&#x590D;&#x4F4D;
<img src="pic/&#x5904;&#x7406;&#x5668;&#x590D;&#x4F4D;.jpg" alt=""></li>
<li>&#x8C03;&#x8BD5;&#x63A5;&#x53E3;&#x521D;&#x59CB;&#x5316;</li>
<li>TLB&#x521D;&#x59CB;&#x5316;&#xFF1A;&#x4E3B;&#x8981;&#x662F;&#x5C06;&#x5168;&#x90E8;&#x8868;&#x9879;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x65E0;&#x6548;&#x9879;&#xFF08;&#x6BCF;&#x9879;&#x9010;&#x4E00;&#x6E05;&#x7A7A;&#xFF09;</li>
<li>Cache&#x521D;&#x59CB;&#x5316;&#xFF1A;Cache&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x4E3B;&#x8981;&#x5305;&#x542B;Tag&#x548C;Data&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x662F;&#x5BF9;Tag&#x7684;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5C06;&#x5176;&#x4E2D;Cache&#x5757;&#x72B6;&#x6001;&#x8BBE;&#x4E3A;&#x65E0;&#x6548;<ul>
<li>&#x64CD;&#x4F5C;&#x4EC0;&#x4E48;cache&#x5206;&#x4E3A;Icache&#x3001;Dcache&#x3001;L2&#x548C;L3&#x56DB;&#x7C7B;</li>
<li>&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#xFF0C;&#x5206;&#x4E3A;index&#x65E0;&#x6548;&#x3001;hit&#x65E0;&#x6548;&#x3001;&#x5199;tag&#x7B49;</li>
</ul>
</li>
</ul>
<h3 id="&#x603B;&#x7EBF;&#x63A5;&#x53E3;&#x521D;&#x59CB;&#x5316;">&#x603B;&#x7EBF;&#x63A5;&#x53E3;&#x521D;&#x59CB;&#x5316;</h3>
<ul>
<li><p>&#x5185;&#x5B58;&#x521D;&#x59CB;&#x5316;&#xFF1A;&#x6839;&#x636E;&#x5185;&#x5B58;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5BF9;&#x5185;&#x5B58;&#x63A7;&#x5236;&#x5668;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<ul>
<li>&#x4E0E;Cache&#x521D;&#x59CB;&#x5316;&#x7C7B;&#x4F3C;&#x7684;&#x662F;&#xFF0C;&#x5185;&#x5B58;&#x521D;&#x59CB;&#x5316;&#x5E76;&#x4E0D;&#x6D89;&#x53CA;&#x5176;&#x5B58;&#x50A8;&#x7684;&#x521D;&#x59CB;&#x6570;&#x636E;&#x3002;</li>
<li><p>&#x4E0E;Cache&#x521D;&#x59CB;&#x5316;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;Cache&#x6709;&#x4E13;&#x95E8;&#x7684;&#x786C;&#x4EF6;&#x63A7;&#x5236;&#x4F4D;&#x6765;&#x8868;&#x793A;Cache&#x5757;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x800C;&#x5185;&#x5B58;&#x5374;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x7684;&#x786C;&#x4EF6;&#x63A7;&#x5236;&#x4F4D;&#x3002;</p>
<ul>
<li><p>&#x5185;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x662F;&#x7531;&#x8F6F;&#x4EF6;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x8F6F;&#x4EF6;&#x77E5;&#x9053;&#x5176;&#x8BBF;&#x95EE;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x662F;&#x5426;&#x5B58;&#x5728;&#x6709;&#x6548;&#x7684;&#x6570;&#x636E;&#x3002;&#x5185;&#x5B58;&#x521D;&#x59CB;&#x5316;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x5BF9;&#x5185;&#x5B58;&#x63A7;&#x5236;&#x5668;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;<strong>&#x5185;&#x5B58;&#x63A7;&#x5236;&#x5668;</strong>&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;</p>
<p>&#x5185;&#x5B58;&#x63A7;&#x5236;&#x5668;&#x521D;&#x59CB;&#x5316;&#xFF1A;</p>
<ul>
<li>&#x6839;&#x636E;&#x5185;&#x5B58;&#x7684;&#x884C;&#x5730;&#x5740;&#x3001;&#x5217;&#x5730;&#x5740;&#x7B49;&#x5BF9;&#x5185;&#x5B58;&#x5730;&#x5740;&#x6620;&#x5C04;&#x8FDB;&#x884C;&#x914D;&#x7F6E;</li>
<li>&#x6839;&#x636E;&#x534F;&#x8BAE;&#x5BF9;&#x5185;&#x5B58;&#x4FE1;&#x53F7;&#x8C03;&#x6574;&#x7684;&#x652F;&#x6301;&#x65B9;&#x5F0F;&#x5BF9;&#x5185;&#x5B58;&#x8BFB;&#x5199;&#x4FE1;&#x53F7;&#x76F8;&#x5173;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x4F20;&#x8F93;&#x65F6;&#x7684;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;</li>
</ul>
</li>
<li>Cache &#x662F;&#x4E00;&#x4E2A;&#x786C;&#x4EF6;&#x52A0;&#x901F;&#x90E8;&#x4EF6;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x8F6F;&#x4EF6;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x771F;&#x6B63;&#x77E5;&#x9053;&#x800C;&#x4E14;&#x4E5F;&#x4E0D;&#x5E0C;&#x671B;&#x77E5;&#x9053;&#x5176;&#x5B58;&#x5728;&#xFF0C;Cache &#x7684;&#x786C;&#x4EF6;&#x63A7;&#x5236;&#x4F4D;&#x6B63;&#x662F;&#x4E3A;&#x4E86;&#x63A9;&#x76D6;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x5EF6;&#x8FDF;&#xFF0C;&#x4FDD;&#x8BC1;&#x8BBF;&#x5B58;&#x64CD;&#x4F5C;&#x7684;&#x6B63;&#x786E;&#x6027;</li>
</ul>
<p>&#x5728;&#x5185;&#x5B58;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x6839;&#x636E;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x5BF9;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x8C03;&#x6574;&#x548C;&#x8BBE;&#x7F6E;&#x3002;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4F11;&#x7720;&#x5524;&#x9192;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x4E2D;&#x5DF2;&#x6709;&#x7684;&#x6570;&#x636E;&#x6765;&#x6062;&#x590D;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#xFF1B;&#x5982;&#x679C;&#x662F;&#x666E;&#x901A;&#x5F00;&#x673A;&#xFF0C;&#x5219;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x4E0D;&#x5173;&#x5FC3;&#x5185;&#x5B58;&#x6570;&#x636E;&#x800C;&#x968F;&#x610F;&#x4F7F;&#x7528;&#x3002;</p>
</li>
</ul>
</li>
<li>IO&#x603B;&#x7EBF;&#x521D;&#x59CB;&#x5316;<ul>
<li>&#x5BF9;IO&#x603B;&#x7EBF;&#x7684;&#x8BBF;&#x95EE;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#xFF0C;&#x5212;&#x5B9A;&#x8BBE;&#x5907;&#x7684;&#x914D;&#x7F6E;&#x8BBF;&#x95EE;&#x7A7A;&#x95F4;&#x3001;IO&#x8BBF;&#x95EE;&#x7A7A;&#x95F4;&#x548C;Memory&#x8BBF;&#x95EE;&#x7A7A;&#x95F4;</li>
<li>&#x5BF9;IO&#x8BBE;&#x5907;&#x7684;DMA&#x8BBF;&#x95EE;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x89C4;&#x5B9A;&#xFF0C;&#x5BF9;&#x5904;&#x7406;&#x5668;&#x80FD;&#x63A5;&#x6536;&#x7684;DMA&#x5185;&#x5B58;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;</li>
<li>&#x5BF9;HT&#x603B;&#x7EBF;&#x8FDB;&#x884C;&#x5347;&#x9891;&#xFF0C;&#x5E76;&#x6269;&#x5C55;&#x603B;&#x7EBF;&#x5BBD;&#x5EA6;</li>
</ul>
</li>
</ul>
<h3 id="&#x8BBE;&#x5907;&#x63A2;&#x6D4B;&#x53CA;&#x9A71;&#x52A8;&#x52A0;&#x8F7D;">&#x8BBE;&#x5907;&#x63A2;&#x6D4B;&#x53CA;&#x9A71;&#x52A8;&#x52A0;&#x8F7D;</h3>
<ul>
<li>IO&#x7CFB;&#x7EDF;&#x7A7A;&#x95F4;&#xFF1A;<ul>
<li>&#x914D;&#x7F6E;&#x7A7A;&#x95F4;&#xFF1A;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x8BBE;&#x5907;&#x63A2;&#x6D4B;&#x548C;&#x53D1;&#x73B0;</li>
<li>IO&#x7A7A;&#x95F4;&#xFF1A;&#x7A7A;&#x95F4;&#x8F83;&#x5C0F;&#xFF0C;&#x7528;&#x4E8E;&#x5C11;&#x91CF;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x8BBF;&#x95EE;</li>
<li>Memory&#x7A7A;&#x95F4;&#xFF1A;&#x7A7A;&#x95F4;&#x53EF;&#x6620;&#x5C04;&#x533A;&#x57DF;&#x8F83;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x6620;&#x5C04;&#x8BBE;&#x5907;&#x6240;&#x9700;&#x8981;&#x7684;&#x5927;&#x5757;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;<blockquote>
<p>X86&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x7A7A;&#x95F4;&#xFF0C;RISCV&#x7684;IO&#x548C;Memory&#x662F;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;</p>
</blockquote>
</li>
</ul>
</li>
<li>PCI&#x8BBE;&#x5907;&#x7684;&#x63A2;&#x6D4B;&#xFF1A;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x7684;&#x8FC7;&#x7A0B;<ol>
<li>&#x5C06;&#x521D;&#x59CB;&#x603B;&#x7EBF;&#x53F7;&#x3001;&#x521D;&#x59CB;&#x8BBE;&#x5907;&#x53F7;&#x3001;&#x521D;&#x59CB;&#x529F;&#x80FD;&#x53F7;&#x8BBE;&#x4E3A;0</li>
<li>&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x603B;&#x7EBF;&#x53F7;&#x3001;&#x8BBE;&#x5907;&#x53F7;&#x3001;&#x529F;&#x80FD;&#x53F7;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x7A7A;&#x95F4;&#x5730;&#x5740;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x5730;&#x5740;&#xFF0C;&#x8BBF;&#x95EE;&#x5176;0&#x53F7;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x68C0;&#x67E5;&#x5176;&#x8BBE;&#x5907;&#x53F7;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BFB;&#x51FA;&#x5168;1&#x6216;&#x5168;0&#xFF0C;&#x8868;&#x793A;&#x65E0;&#x8BBE;&#x5907;</li>
<li>&#x5982;&#x679C;&#x8BE5;&#x8BBE;&#x5907;&#x4E3A;&#x6709;&#x6548;&#x8BBE;&#x5907;&#xFF0C;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A; BAR &#x6240;&#x9700;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x6536;&#x96C6;&#x76F8;&#x5173;&#x4FE1;&#x606F;</li>
<li>&#x68C0;&#x6D4B;&#x5176;&#x662F;&#x5426;&#x4E3A;&#x4E00;&#x4E2A;&#x591A;&#x529F;&#x80FD;&#x8BBE;&#x5907;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5219;&#x5C06;&#x529F;&#x80FD;&#x53F7;&#x52A0;1&#x518D;&#x91CD;&#x590D;&#x626B;&#x63CF;&#xFF0C;&#x6267;&#x884C;&#x7B2C;2&#x6B65;</li>
<li>&#x5982;&#x679C;&#x8BE5;&#x8BBE;&#x5907;&#x4E3A;&#x6865;&#x8BBE;&#x5907;&#xFF0C;&#x5219;&#x7ED9;&#x8BE5;&#x6865;&#x914D;&#x7F6E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x603B;&#x7EBF;&#x53F7;&#xFF0C;&#x518D;&#x4F7F;&#x7528;&#x8BE5;&#x603B;&#x7EBF;&#x53F7;&#xFF0C;&#x4ECE;&#x8BBE;&#x5907;&#x53F7;0&#x3001;&#x529F;&#x80FD;&#x53F7;0&#x5F00;&#x59CB;&#x9012;&#x5F52;&#x8C03;&#x7528;&#xFF0C;&#x6267;&#x884C;&#x7B2C;2&#x6B65;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BBE;&#x5907;&#x53F7;&#x975E;31&#xFF0C;&#x5219;&#x8BBE;&#x5907;&#x53F7;&#x52A0;1&#xFF0C;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7B2C;2&#x6B65;&#xFF1B;&#x5982;&#x679C;&#x8BBE;&#x5907;&#x53F7;&#x4E3A;31&#xFF0C;&#x4E14;&#x603B;&#x7EBF;&#x53F7;&#x4E3A;0&#xFF0C;&#x8868;&#x793A;&#x626B;&#x63CF;&#x7ED3;&#x675F;&#xFF0C;&#x5982;&#x679C;&#x603B;&#x7EBF;&#x53F7;&#x975E;0&#xFF0C;&#x5219;&#x9000;&#x56DE;&#x4E0A;&#x4E00;&#x5C42;&#x9012;&#x5F52;&#x8C03;&#x7528;</li>
</ol>
</li>
</ul>
<h3 id="&#x591A;&#x6838;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;">&#x591A;&#x6838;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;</h3>
<ul>
<li>&#x521D;&#x59CB;&#x5316;&#x65F6;&#x591A;&#x6838;&#x534F;&#x540C;<ul>
<li>BIOS&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x8F6E;&#x8BE2;&#x5B9E;&#x73B0;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x534F;&#x540C;</li>
<li>&#x4E3B;&#x6838;&#x9664;&#x4E86;&#x5BF9;&#x672C;&#x5904;&#x7406;&#x5668;&#x6838;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x8D1F;&#x8D23;&#x5BF9;&#x5404;&#x79CD;&#x603B;&#x7EBF;&#x53CA;&#x5916;&#x8BBE;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF1B;&#x800C;&#x4ECE;&#x6838;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x672C;&#x5904;&#x7406;&#x5668;&#x6838;&#x7684;&#x79C1;&#x6709;&#x90E8;&#x4EF6;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF08;&#x5982;&#xFF0C;&#x6838;&#x5185;&#x79C1;&#x6709;&#x5BC4;&#x5B58;&#x5668;&#x3001;TLB&#x3001;&#x79C1;&#x6709;Cache&#x7B49;&#xFF09;</li>
</ul>
</li>
<li>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x65F6;&#x591A;&#x6838;&#x5524;&#x9192;<ul>
<li>&#x4E3B;&#x6838;&#x5728;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x51C6;&#x5907;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x4F9D;&#x6B21;&#x5524;&#x9192;&#x6BCF;&#x4E00;&#x4E2A;&#x4ECE;&#x6838;&#xFF0C;&#x5524;&#x9192;&#x4ECE;&#x6838;&#x540E;&#x4E3B;&#x6838;&#x8FDB;&#x5165;&#x7B49;&#x5F85;&#x8FC7;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x4ECE;&#x6838;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x901A;&#x77E5;&#x4E3B;&#x6838;&#xFF0C;&#x518D;&#x5524;&#x9192;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4ECE;&#x6838;</li>
<li>&#x5524;&#x9192;&#x8FC7;&#x7A0B;&#x662F;&#x4E32;&#x884C;&#x7684;</li>
</ul>
</li>
<li>&#x6838;&#x95F4;&#x540C;&#x6B65;&#x4E0E;&#x901A;&#x4FE1;&#xFF1A;<strong>&#x6838;&#x95F4;&#x4E2D;&#x65AD;</strong><ul>
<li>&#x5229;&#x7528;&#x4E00;&#x7EC4;IO&#x5BC4;&#x5B58;&#x5668;&#x5B9E;&#x73B0;&#xFF1A;&#x76EE;&#x6807;&#x6838;&#x6838;&#x95F4;&#x4E2D;&#x65AD;&#x5BC4;&#x5B58;&#x5668;&#x7F6E;1&#x6765;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#xFF0C;&#x4F7F;&#x76EE;&#x6807;&#x6838;&#x8FDB;&#x5165;&#x4E2D;&#x65AD;&#x5904;&#x7406;</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="06ji-suan-ji-zong-xian-jie-kou-ji-zhu.html" class="navigation navigation-prev " aria-label="Previous page: 06计算机总线接口技术">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="08yun-suan-qi-she-ji.html" class="navigation navigation-next " aria-label="Next page: 08运算器设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"07计算机系统启动过程分析","level":"1.8","depth":1,"next":{"title":"08运算器设计","level":"1.9","depth":1,"path":"08yun-suan-qi-she-ji.md","ref":"08yun-suan-qi-she-ji.md","articles":[]},"previous":{"title":"06计算机总线接口技术","level":"1.7","depth":1,"path":"06ji-suan-ji-zong-xian-jie-kou-ji-zhu.md","ref":"06ji-suan-ji-zong-xian-jie-kou-ji-zhu.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"07ji-suan-ji-xi-tong-qi-dong-guo-cheng-fen-xi.md","mtime":"2024-01-09T04:22:50.253Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-01-09T04:39:29.842Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

