
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>重点能力 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="12ji-suan-ji-xing-neng-fen-xi.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01yin-yan.html">
            
                <a href="01yin-yan.html">
            
                    
                    01引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02zhi-ling-xi-tong.html">
            
                <a href="02zhi-ling-xi-tong.html">
            
                    
                    02指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03te-quan-zhi-ling-xi-tong.html">
            
                <a href="03te-quan-zhi-ling-xi-tong.html">
            
                    
                    03特权指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04ruan-ying-jian-xie-tong.html">
            
                <a href="04ruan-ying-jian-xie-tong.html">
            
                    
                    04软硬件协同
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05ji-suan-ji-zu-cheng-yuan-li-he-jie-gou.html">
            
                <a href="05ji-suan-ji-zu-cheng-yuan-li-he-jie-gou.html">
            
                    
                    05计算机组成原理和结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06ji-suan-ji-zong-xian-jie-kou-ji-zhu.html">
            
                <a href="06ji-suan-ji-zong-xian-jie-kou-ji-zhu.html">
            
                    
                    06计算机总线接口技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07ji-suan-ji-xi-tong-qi-dong-guo-cheng-fen-xi.html">
            
                <a href="07ji-suan-ji-xi-tong-qi-dong-guo-cheng-fen-xi.html">
            
                    
                    07计算机系统启动过程分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08yun-suan-qi-she-ji.html">
            
                <a href="08yun-suan-qi-she-ji.html">
            
                    
                    08运算器设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09zhi-ling-liu-shui-xian.html">
            
                <a href="09zhi-ling-liu-shui-xian.html">
            
                    
                    09指令流水线
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10bing-xing-bian-cheng-ji-chu.html">
            
                <a href="10bing-xing-bian-cheng-ji-chu.html">
            
                    
                    10并行编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11duo-he-chu-li-jie-gou.html">
            
                <a href="11duo-he-chu-li-jie-gou.html">
            
                    
                    11多核处理结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12ji-suan-ji-xing-neng-fen-xi.html">
            
                <a href="12ji-suan-ji-xing-neng-fen-xi.html">
            
                    
                    12计算机性能分析
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="zhong-dian-neng-li.html">
            
                <a href="zhong-dian-neng-li.html">
            
                    
                    重点能力
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >重点能力</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x91CD;&#x70B9;&#x80FD;&#x529B;">&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x91CD;&#x70B9;&#x80FD;&#x529B;</h1>
<h3 id="&#x638C;&#x63E1;&#x4ECE;&#x952E;&#x76D8;&#x64CD;&#x4F5C;&#x5230;&#x663E;&#x793A;&#x53D8;&#x5316;&#x7684;&#x6574;&#x4F53;&#x8F6F;&#x786C;&#x4EF6;&#x8FC7;&#x7A0B;">&#x638C;&#x63E1;&#x4ECE;&#x952E;&#x76D8;&#x64CD;&#x4F5C;&#x5230;&#x663E;&#x793A;&#x53D8;&#x5316;&#x7684;&#x6574;&#x4F53;&#x8F6F;&#x786C;&#x4EF6;&#x8FC7;&#x7A0B;</h3>
<ul>
<li><p>&#x5982;&#xFF1A;PPT&#x7FFB;&#x9875;&#x8FC7;&#x7A0B;</p>
<ul>
<li>&#x6309;&#x4E00;&#x4E0B;&#x952E;&#x76D8;&#xFF0C;&#x952E;&#x76D8;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x9001;&#x5230;&#x5357;&#x6865;&#x82AF;&#x7247;&#xFF0C;&#x5357;&#x6865;&#x82AF;&#x7247;&#x628A;&#x952E;&#x76D8;&#x7684;&#x7F16;&#x7801;&#x4FDD;&#x5B58;&#x5728;&#x5357;&#x6865;&#x5185;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x5E76;&#x5411;&#x5904;&#x7406;&#x5668;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#x3002;&#x8BE5;&#x5916;&#x90E8;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#x4F20;&#x5230; CPU&#x5185;&#x90E8;&#x540E;&#x628A;CPU&#x4E2D;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x67D0;&#x4E00;&#x4F4D;&#x7F6E;&#x4E3A;&#x201C;1&#x201D;&#xFF0C;&#x8868;&#x793A;&#x6536;&#x5230;&#x4E86;&#x5916;&#x90E8;&#x4E2D;&#x65AD;&#x3002;CPU &#x4E2D;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#x6709;&#x5C4F;&#x853D;&#x4F4D;&#x6765;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x5916;&#x90E8;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#x3002;</li>
<li>&#x5C4F;&#x853D;&#x5904;&#x7406;&#x540E;&#x7684;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#x88AB;&#x9644;&#x5728;&#x4E00;&#x6761;&#x8BD1;&#x7801;&#x540E;&#x7684;&#x6307;&#x4EE4;&#x4E0A;&#x9001;&#x5230;&#x91CD;&#x6392;&#x5E8F;&#x7F13;&#x51B2; (ROB)&#x3002;&#x5916;&#x90E8;&#x4E2D;&#x65AD;&#x662F;&#x4F8B;&#x5916; (Exception&#xFF0C;&#x4E5F;&#x79F0;&#x201C;&#x5F02;&#x5E38;&#x201D;) &#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x53D1;&#x751F;&#x4F8B;&#x5916;&#x7684;&#x6307;&#x4EE4;&#x4E0D;&#x4F1A;&#x88AB;&#x9001;&#x5230;&#x529F;&#x80FD;&#x90E8;&#x4EF6;&#x6267;&#x884C;&#x3002;&#x5F53;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x6210;&#x4E3A;&#x91CD;&#x6392;&#x5E8F;&#x7F13;&#x51B2;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x65F6; CPU &#x5904;&#x7406;&#x4F8B;&#x5916;&#x3002;&#x91CD;&#x6392;&#x5E8F;&#x7F13;&#x51B2;&#x4E3A;&#x4E86;&#x7ED9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x4F8B;&#x5916;&#x73B0;&#x573A;&#xFF0C;&#x5904;&#x7406;&#x4F8B;&#x5916;&#x524D;&#x8981;&#x628A;&#x4F8B;&#x5916;&#x6307;&#x4EE4;&#x524D;&#x9762;&#x7684;&#x6307;&#x4EE4;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x6307;&#x4EE4;&#x90FD;&#x53D6;&#x6D88;&#x6389;&#x3002;</li>
<li>&#x91CD;&#x6392;&#x5E8F;&#x7F13;&#x51B2;&#x5411;&#x6240;&#x6709;&#x7684;&#x6A21;&#x5757;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x53D6;&#x6D88;&#x4FE1;&#x53F7;&#xFF0C;&#x53D6;&#x6D88;&#x8BE5;&#x6307;&#x4EE4;&#x540E;&#x9762;&#x7684;&#x6240;&#x6709;&#x6307;&#x4EE4;&#xFF1A;&#x4FEE;&#x6539;&#x63A7;&#x5236;&#x5BC4;&#x5728;&#x5668;&#xFF0C;&#x628A;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x8BBE;&#x4E3A;&#x6838;&#x5FC3;&#x6001;&#xFF1B;&#x4FDD;&#x5B58;&#x4F8B;&#x5916;&#x539F;&#x56E0;&#x3001;&#x53D1;&#x751F;&#x4F8B;&#x5916;&#x7684;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668; (Program Counter&#xFF0C;&#x7B80;&#x79F0;PC) &#x7B49;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF1A;&#x7136;&#x540E;&#x628A;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x7F6E;&#x4E3A;&#x76F8;&#x5E94;&#x7684;&#x4F8B;&#x5916;&#x5904;&#x7406;&#x5165;&#x53E3;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x53D6;&#x6307;&#x3002;</li>
<li>&#x5904;&#x7406;&#x5668;&#x8DF3;&#x8F6C;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x4F8B;&#x5916;&#x5904;&#x7406;&#x5668;&#x5165;&#x53E3;&#x540E;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4EE3;&#x7801;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9996;&#x5148;&#x4FDD;&#x5B58;&#x5904;&#x7406;&#x5668;&#x73B0;&#x573A;&#xFF0C;&#x5305;&#x62EC;&#x5BC4;&#x5B58;&#x5668;&#x5185;&#x5BB9;&#x7B49;&#x3002;&#x4FDD;&#x5B58;&#x73B0;&#x573A;&#x540E;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5411; CPU &#x7684;&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#x8BFB;&#x4F8B;&#x5916;&#x539F;&#x56E0;&#xFF0C;&#x53D1;&#x73B0;&#x662F;&#x5916;&#x90E8;&#x4E2D;&#x65AD;&#x4F8B;&#x5916;&#xFF0C;&#x5C31;&#x5411;&#x5357;&#x6865;&#x7684;&#x4E2D;&#x65AD;&#x63A7;&#x5236;&#x5668;&#x8BFB;&#x4E2D;&#x65AD;&#x539F;&#x56E0;&#xFF0C;&#x8BFB;&#x7684;&#x540C;&#x65F6;&#x6E05;&#x9664;&#x5357;&#x6865;&#x7684;&#x4E2D;&#x65AD;&#x4F4D;&#x3002;&#x8BFB;&#x56DE;&#x6765;&#x540E;&#x53D1;&#x73B0;&#x4E2D;&#x65AD;&#x539F;&#x56E0;&#x662F;&#x6709;&#x4EBA;&#x6572;&#x4E86;&#x7A7A;&#x683C;&#x952E;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x67E5;&#x627E;&#x8BFB;&#x5230;&#x7684;&#x7A7A;&#x683C;&#x662F;&#x7ED9;&#x8C01;&#x7684;:&#x6709;&#x6CA1;&#x6709;&#x8FDB;&#x7A0B;&#x5904;&#x5728;&#x963B;&#x585E;&#x72B6;&#x6001;&#x7B49;&#x952E;&#x76D8;&#x8F93;&#x5165;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x5B66;&#x8FC7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#xFF0C;&#x77E5;&#x9053;&#x8FDB;&#x7A0B;&#x81F3;&#x5C11;&#x6709;&#x4E09;&#x4E2A;&#x72B6;&#x6001;&#x4E00;&#x4E00;&#x8FD0;&#x884C;&#x6001;&#x3001;&#x963B;&#x585E;&#x6001;&#x3001;&#x5C31;&#x7EEA;&#x6001;&#xFF0C;&#x8FDB;&#x7A0B;&#x5728;&#x7B49;IO&#x8F93;&#x4EBA;&#x65F6;&#x5904;&#x5728;&#x963B;&#x585E;&#x6001;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53D1;&#x73B0;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; WPS &#x7684;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x5BF9;&#x7A7A;&#x683C;&#x952E;&#x4F1A;&#x6709;&#x6240;&#x54CD;&#x5E94;&#xFF0C;&#x5C31;&#x628A; WPS &#x5524;&#x9192;&#x3002;</li>
<li><p>WPS &#x88AB;&#x5524;&#x9192;&#x540E;&#x5904;&#x5728;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x3002;&#x53D1;&#x73B0;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F20;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E2A;&#x952E;&#x76D8;&#x8F93;&#x5165;&#x7A7A;&#x683C;&#xFF0C;&#x8868;&#x793A;&#x8981;&#x7FFB;&#x9875;&#x3002;WPS &#x5C31;&#x628A;&#x4E0B;&#x4E00;&#x9875;&#x8981;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#x51C6;&#x5907;&#x597D;&#xFF0C;&#x8C03;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x663E;&#x793A;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x628A;&#x8981;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#x9001;&#x5230;&#x663E;&#x5B58;&#xFF0C;&#x7531;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x5668; (GPU) &#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x663E;&#x5B58;&#x7A7A;&#x95F4;&#x5237;&#x65B0;&#x5C4F;&#x5E55;&#xFF0C;&#x8FBE;&#x5230;&#x4E86;&#x7FFB;&#x4E00;&#x9875;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<blockquote>
<p>&#x7B49;&#x5F85;&#x6309;&#x952E;&#x2014;&#x2014;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#xFF08;&#x6838;&#x5FC3;&#x6001;&#xFF09;&#x2014;&#x2014;&#x51C6;&#x5907;&#x6570;&#x636E;&#x2014;&#x2014;&#x64CD;&#x4F5C;&#x663E;&#x5B58;&#xFF08;&#x6838;&#x5FC3;&#x6001;&#xFF09;&#x2014;&#x2014;&#x8FD4;&#x56DE;PPT</p>
</blockquote>
</li>
</ul>
</li>
</ul>
<h3 id="&#x638C;&#x63E1;&#x57FA;&#x4E8E;loongarch&#x5904;&#x7406;&#x5668;&#x7684;linux&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;tlb&#x4F8B;&#x5916;&#x8FC7;&#x7A0B;">&#x638C;&#x63E1;&#x57FA;&#x4E8E;LoongArch&#x5904;&#x7406;&#x5668;&#x7684;Linux&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;TLB&#x4F8B;&#x5916;&#x8FC7;&#x7A0B;</h3>
<ul>
<li>&#x6307;&#x51FA;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#x5171;&#x4EA7;&#x751F;&#x591A;&#x5C11;&#x6B21;TLB refi1&#x548C;TLB invalid&#x5F02;&#x5E38;&#xFF08;&#x53EF;&#x80FD;&#x5305;&#x542B;TLB&#x66FF;&#x6362;&#x548C;&#x8FDB;&#x7A0B;&#x5207;&#x6362;&#xFF09;
<img src="pic/TLBQ.png" alt="">
<img src="pic/TLBA.png" alt=""></li>
</ul>
<h3 id="c&#x8BED;&#x8A00;&#x4E0E;&#x6307;&#x4EE4;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x7CFB;">C&#x8BED;&#x8A00;&#x4E0E;&#x6307;&#x4EE4;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x7CFB;</h3>
<ul>
<li>C&#x8BED;&#x8A00;&#x7684;&#x4E0D;&#x540C;&#x53D8;&#x91CF;&#xFF08;&#x5168;&#x5C40;&#x3001;&#x5C40;&#x90E8;&#x7B49;&#xFF09;&#x6620;&#x5C04;&#x5230;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x54EA;&#x4E9B;&#x6BB5;&#xFF1F;<ol>
<li>&#x5185;&#x5B58;&#x6808;&#x533A;&#xFF1A; &#x5B58;&#x653E;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x540D;&#xFF1B;</li>
<li>&#x5185;&#x5B58;&#x5806;&#x533A;&#xFF1A; &#x5B58;&#x653E;new&#x6216;&#x8005;malloc&#x51FA;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;</li>
<li>&#x5E38;&#x6570;&#x533A;&#xFF1A; &#x5B58;&#x653E;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x6216;&#x8005;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF1B;</li>
<li>&#x9759;&#x6001;&#x533A;&#xFF1A; &#x7528;&#x4E8E;&#x5B58;&#x653E;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6216;&#x8005;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF1B;</li>
<li>&#x4EE3;&#x7801;&#x533A;&#xFF1A;&#x4E8C;&#x8FDB;&#x5236;&#x4EE3;&#x7801;</li>
</ol>
</li>
<li>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3001;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3001;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x3001;&#x8FDB;&#x7A0B;&#x5207;&#x6362;&#x90FD;&#x9700;&#x8981;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#xFF0C;&#x8BF7;&#x7ED3;&#x5408;LoongArch&#x7684;ABI&#x8BF4;&#x660E;&#x4E0A;&#x8FF0;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x65F6;&#x4FDD;&#x7559;&#x73B0;&#x573A;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF08;&#x5185;&#x5BB9;&#x3001;&#x4F4D;&#x7F6E;&#xFF09;&#xFF1F;<ul>
<li><strong>&#x51FD;&#x6570;&#x8C03;&#x7528;</strong>&#xFF1A;&#x7528;&#x6237;&#x4E3B;&#x52A8;&#x53D1;&#x8D77;&#x7684;&#x6307;&#x4EE4;&#x6D41;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x6539;&#x53D8;<ul>
<li><strong>&#x90E8;&#x5206;&#x5BC4;&#x5B58;&#x5668;&#xFF08;&#x5305;&#x62EC;&#x6808;&#x5E27;&#x76F8;&#x5173;&#x7684;$sp&#x548C;$fp&#xFF09;&#x3001;&#x8FD4;&#x56DE;&#x5730;&#x5740;</strong></li>
</ul>
</li>
<li><strong>&#x7CFB;&#x7EDF;&#x8C03;&#x7528;</strong>&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E3A;&#x7528;&#x6237;&#x6001;&#x7A0B;&#x5E8F;&#x5B9E;&#x73B0;&#x7684;&#x5B50;&#x7A0B;&#x5E8F;<ul>
<li>&#x548C;&#x666E;&#x901A;&#x8C03;&#x7528;&#x76F8;&#x6BD4;&#x4E3B;&#x8981;&#x591A;&#x4E86;&#x7279;&#x6743;&#x7B49;&#x7EA7;&#x7684;&#x5207;&#x6362;</li>
<li><strong>&#x90E8;&#x5206;&#x5B9A;&#x70B9;&#x5BC4;&#x5B58;&#x5668;&#xFF08;&#x5305;&#x62EC;&#x6808;&#x5E27;&#x76F8;&#x5173;&#x5BC4;&#x5B58;&#x5668;&#xFF09;&#x3001;&#x5F02;&#x5E38;&#x73B0;&#x573A;&#x4FE1;&#x606F;</strong></li>
</ul>
</li>
<li><strong>&#x4F8B;&#x5916;&#x5904;&#x7406;</strong>&#xFF08;&#x5F02;&#x5E38;&#x548C;&#x4E2D;&#x65AD;&#xFF09;<ul>
<li>&#x901A;&#x5E38;&#x6808;&#x6307;&#x9488;&#x4E5F;&#x4F1A;&#x88AB;&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;&#x4E3A;&#x6307;&#x5411;&#x5185;&#x6838;&#x6001;&#x4EE3;&#x7801;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6808;&#xFF0C;&#x4EE5;&#x4FBF;&#x9694;&#x79BB;&#x4E0D;&#x540C;&#x7279;&#x6743;&#x7B49;&#x7EA7;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x4FE1;&#x606F;</li>
<li><strong>&#xFF08;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#xFF09;&#x5168;&#x90E8;&#x5B9A;&#x70B9;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x5F02;&#x5E38;&#x73B0;&#x573A;&#x4FE1;&#x606F;&#x3001;&#x5F02;&#x5E38;&#x76F8;&#x5173;&#x4FE1;&#x606F;</strong></li>
</ul>
</li>
<li><strong>&#x7EBF;&#x7A0B;&#x5207;&#x6362;</strong>&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x7BA1;&#x7406;&#x6216;&#x7528;&#x6237;&#x6001;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#x6216;&#x4E24;&#x8005;&#x6DF7;&#x5408;<ul>
<li>&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x56E0;&#x6B64;&#x5185;&#x5B58;&#x4E0D;&#x53D8;</li>
<li>&#x5171;&#x4EAB;&#x6253;&#x5F00;&#x6587;&#x4EF6;</li>
<li>&#x903B;&#x8F91;&#x4E0A;&#x62E5;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x72B6;&#x6001;&#x548C;&#x6808;</li>
<li><strong>&#x5168;&#x90E8;&#x7528;&#x6237;&#x6001;&#x5BC4;&#x5B58;&#x5668;&#x3001;TLS&#x3001;&#x5F53;&#x524D;PC&#x7B49;&#x76F8;&#x5173;&#x4FE1;&#x606F;</strong></li>
</ul>
</li>
<li><strong>&#x8FDB;&#x7A0B;&#x5207;&#x6362;</strong>&#xFF1A;&#x4E3B;&#x8981;&#x7531;&#x8F6F;&#x4EF6;&#x5B8C;&#x6210;<ul>
<li>&#x8FDB;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x5305;&#x62EC;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x8BB0;&#x5F55;&#x7684;&#x5404;&#x79CD;&#x4FE1;&#x606F;&#xFF08;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5730;&#x5740;&#x3001;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x3001;&#x9501;&#x548C;&#x4FE1;&#x53F7;&#x7B49;&#x8D44;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#xFF09;</li>
<li>&#x8981;&#x5207;&#x5185;&#x5B58;&#x5185;&#x5BB9;</li>
<li><strong>&#x5168;&#x90E8;&#x7528;&#x6237;&#x6001;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x9875;&#x8868;&#x57FA;&#x5740;&#x7B49;&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x5F53;&#x524D;PC&#x7B49;&#x76F8;&#x5173;&#x4FE1;&#x606F;</strong></li>
</ul>
</li>
<li><strong>&#x865A;&#x62DF;&#x673A;&#x5207;&#x6362;</strong>&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x7531;&#x8F6F;&#x4EF6;&#x5B9E;&#x73B0;<ul>
<li>&#x4E0A;&#x4E0B;&#x6587;&#x5305;&#x62EC;CPU&#x3001;&#x5185;&#x5B58;&#x548C;&#x5916;&#x8BBE;&#x72B6;&#x6001;</li>
<li>&#x6838;&#x5FC3;&#x6001;&#x8981;&#x53D8;</li>
<li><strong>&#x865A;&#x62DF;CPU&#x72B6;&#x6001;&#xFF08;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x5FC5;&#x8981;&#x7279;&#x6743;&#x8D44;&#x6E90;&#xFF09;</strong></li>
</ul>
</li>
</ul>
</li>
</ul>
<p>&#x524D;&#x4E09;&#x8005;&#x4FDD;&#x7559;&#x73B0;&#x573A;&#x56E0;&#x60C5;&#x51B5;&#x800C;&#x5F02;&#xFF1B;&#x540E;&#x4E09;&#x4E2A;&#x5207;&#x6362;&#x540E;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x6BD4;&#x8F83;&#x5B8C;&#x6574;&#x7684;&#x73B0;&#x573A;</p>
<h3 id="&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#x65F6;pci&#x8BBE;&#x5907;&#x7684;&#x63A2;&#x6D4B;">&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#x65F6;PCI&#x8BBE;&#x5907;&#x7684;&#x63A2;&#x6D4B;</h3>
<ul>
<li>&#x5982;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x5173;IO&#x8BBE;&#x5907;&#x662F;&#x5982;&#x4F55;&#x63A2;&#x6D4B;&#x5230;&#x7684;<blockquote>
<ul>
<li>PCI&#x8BBE;&#x5907;&#x7684;&#x63A2;&#x6D4B;&#xFF1A;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x7684;&#x8FC7;&#x7A0B;<ol>
<li>&#x5C06;&#x521D;&#x59CB;&#x603B;&#x7EBF;&#x53F7;&#x3001;&#x521D;&#x59CB;&#x8BBE;&#x5907;&#x53F7;&#x3001;&#x521D;&#x59CB;&#x529F;&#x80FD;&#x53F7;&#x8BBE;&#x4E3A;0</li>
<li>&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x603B;&#x7EBF;&#x53F7;&#x3001;&#x8BBE;&#x5907;&#x53F7;&#x3001;&#x529F;&#x80FD;&#x53F7;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x7A7A;&#x95F4;&#x5730;&#x5740;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x5730;&#x5740;&#xFF0C;&#x8BBF;&#x95EE;&#x5176;0&#x53F7;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x68C0;&#x67E5;&#x5176;&#x8BBE;&#x5907;&#x53F7;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BFB;&#x51FA;&#x5168;1&#x6216;&#x5168;0&#xFF0C;&#x8868;&#x793A;&#x65E0;&#x8BBE;&#x5907;</li>
<li>&#x5982;&#x679C;&#x8BE5;&#x8BBE;&#x5907;&#x4E3A;&#x6709;&#x6548;&#x8BBE;&#x5907;&#xFF0C;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A; BAR &#x6240;&#x9700;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x6536;&#x96C6;&#x76F8;&#x5173;&#x4FE1;&#x606F;</li>
<li>&#x68C0;&#x6D4B;&#x5176;&#x662F;&#x5426;&#x4E3A;&#x4E00;&#x4E2A;&#x591A;&#x529F;&#x80FD;&#x8BBE;&#x5907;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5219;&#x5C06;&#x529F;&#x80FD;&#x53F7;&#x52A0;1&#x518D;&#x91CD;&#x590D;&#x626B;&#x63CF;&#xFF0C;&#x6267;&#x884C;&#x7B2C;2&#x6B65;</li>
<li>&#x5982;&#x679C;&#x8BE5;&#x8BBE;&#x5907;&#x4E3A;&#x6865;&#x8BBE;&#x5907;&#xFF0C;&#x5219;&#x7ED9;&#x8BE5;&#x6865;&#x914D;&#x7F6E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x603B;&#x7EBF;&#x53F7;&#xFF0C;&#x518D;&#x4F7F;&#x7528;&#x8BE5;&#x603B;&#x7EBF;&#x53F7;&#xFF0C;&#x4ECE;&#x8BBE;&#x5907;&#x53F7;0&#x3001;&#x529F;&#x80FD;&#x53F7;0&#x5F00;&#x59CB;&#x9012;&#x5F52;&#x8C03;&#x7528;&#xFF0C;&#x6267;&#x884C;&#x7B2C;2&#x6B65;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BBE;&#x5907;&#x53F7;&#x975E;31&#xFF0C;&#x5219;&#x8BBE;&#x5907;&#x53F7;&#x52A0;1&#xFF0C;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7B2C;2&#x6B65;&#xFF1B;&#x5982;&#x679C;&#x8BBE;&#x5907;&#x53F7;&#x4E3A;31&#xFF0C;&#x4E14;&#x603B;&#x7EBF;&#x53F7;&#x4E3A;0&#xFF0C;&#x8868;&#x793A;&#x626B;&#x63CF;&#x7ED3;&#x675F;&#xFF0C;&#x5982;&#x679C;&#x603B;&#x7EBF;&#x53F7;&#x975E;0&#xFF0C;&#x5219;&#x9000;&#x56DE;&#x4E0A;&#x4E00;&#x5C42;&#x9012;&#x5F52;&#x8C03;&#x7528;</li>
</ol>
</li>
</ul>
</blockquote>
</li>
</ul>
<h3 id="io&#x901A;&#x4FE1;&#x65F6;dma&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;">IO&#x901A;&#x4FE1;&#x65F6;DMA&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;</h3>
<ul>
<li>&#x5982;&#x7B80;&#x5355;&#x63CF;&#x8FF0;&#x4ECE;&#x786C;&#x76D8;&#x8BFB;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;DMA&#x8FC7;&#x7A0B;<ul>
<li>&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x7684;&#x6D41;&#x7A0B;<ol>
<li>&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7684;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;write&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;</li>
<li>CPU&#x8FDB;&#x5165;&#x5185;&#x6838;&#x6001;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x62F7;&#x8D1D;&#x5230;&#x9875;&#x7F13;&#x5B58;,&#x5199;&#x5165;&#x6210;&#x529F;&#xFF0C;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x3002;</li>
<li>&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;fsync&#x3001;fdatasync&#x3001;sync&#x7B49;&#x5237;&#x76D8;&#x6307;&#x4EE4;&#x3002;CPU&#x4F1A;&#x5411;DMA&#x63A7;&#x5236;&#x5668;&#x53D1;&#x9001;&#x5199;&#x6307;&#x4EE4;&#xFF0C;&#x544A;&#x8BC9;&#x78C1;&#x76D8;&#x63A7;&#x5236;&#x5668;&#x8981;&#x5237;&#x76D8;&#x7684;&#x6570;&#x636E;&#x5728;&#x4E3B;&#x5B58;&#x7684;&#x4F4D;&#x7F6E;&#x3001;&#x8981;&#x5237;&#x76D8;&#x591A;&#x5C11;&#x6570;&#x636E;&#x3001;&#x8981;&#x5237;&#x5230;&#x78C1;&#x76D8;&#x4EC0;&#x4E48;&#x4F4D;&#x7F6E;&#x7B49;&#xFF0C;&#x7136;&#x540E;CPU&#x5C31;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x5E72;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</li>
<li>DMA&#x63A7;&#x5236;&#x5668;&#x5F00;&#x59CB;&#x5C06;&#x9875;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;&#x78C1;&#x76D8;&#x3002;</li>
<li>&#x5199;&#x5B8C;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;DMA&#x63A7;&#x5236;&#x5668;&#x4F1A;&#x5411;CPU&#x53D1;&#x51FA;&#x4E2D;&#x65AD;&#x8BF7;&#x6C42;&#xFF0C;&#x89E6;&#x53D1;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x626B;&#x5C3E;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</li>
</ol>
</li>
<li>&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x6D41;&#x7A0B;<ol>
<li>&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x8C03;&#x7528;read&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;</li>
<li>CPU&#x8FDB;&#x5165;&#x5185;&#x6838;&#x6001;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x68C0;&#x67E5;&#x9875;&#x7F13;&#x5B58;&#x662F;&#x5426;&#x6709;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x6709;CPU&#x62F7;&#x8D1D;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5230;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF1B;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5219;&#x89E6;&#x53D1;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#xFF0C;&#x9700;&#x8981;&#x5411;&#x78C1;&#x76D8;&#x8C03;&#x9875;,&#x5373;&#x4ECE;&#x78C1;&#x76D8;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x5230;&#x9875;&#x7F13;&#x5B58;&#x3002;</li>
<li>CPU&#x5411;DMA&#x63A7;&#x5236;&#x5668;&#x53D1;&#x9001;&#x8BFB;&#x6307;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x544A;&#x8BC9;&#x78C1;&#x76D8;&#x4E3B;&#x5B58;&#x5730;&#x5740;&#x3001;&#x8981;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#x957F;&#x5EA6;&#x3001;&#x8981;&#x4ECE;&#x54EA;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x8BFB;&#xFF0C;&#x7136;&#x540E;CPU&#x8FD4;&#x56DE;&#x5E72;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</li>
<li>DMA&#x63A7;&#x5236;&#x5668;&#x5C06;&#x78C1;&#x76D8;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x62F7;&#x8D1D;&#x5230;&#x9875;&#x7F13;&#x5B58;&#x3002;</li>
<li>&#x6570;&#x636E;&#x62F7;&#x8D1D;&#x5B8C;&#x6210;&#x540E;&#xFF0C;DMA&#x63A7;&#x5236;&#x5668;&#x5411;CPU&#x53D1;&#x9001;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#xFF0C;&#x89E6;&#x53D1;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FDB;&#x884C;&#x626B;&#x5C3E;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x9875;&#x7F13;&#x5B58;&#x628A;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x7ED9;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x3002;</li>
</ol>
</li>
</ul>
</li>
</ul>
<blockquote>
<ul>
<li>DMA&#x65B9;&#x5F0F;&#xFF1A;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x5668;&#x8BBF;&#x95EE;<ul>
<li>&#x5728;&#x50A8;&#x5668;&#x548C;&#x5916;&#x8BBE;&#x4E4B;&#x95F4;&#x5F00;&#x8F9F;&#x76F4;&#x63A5;&#x7684;&#x6570;&#x636E;&#x4F20;&#x9001;&#x901A;&#x9053;&#xFF0C;&#x6570;&#x636E;&#x4F20;&#x9001;&#x7531;&#x4E13;&#x95E8;&#x7684;&#x786C;&#x4EF6;&#xFF08;DMA&#x63A7;&#x5236;&#x5668;&#xFF09;&#x6765;&#x63A7;&#x5236;</li>
<li>&#x5904;&#x7406;&#x5668;&#x4E3A;DMA&#x8BF7;&#x6C42;&#x9884;&#x5148;&#x5206;&#x914D;&#x4E00;&#x6BB5;&#x5730;&#x5740;&#x7A7A;&#x95F4;</li>
<li>&#x5904;&#x7406;&#x5668;&#x8BBE;&#x7F6E;DMA&#x63A7;&#x5236;&#x5668;&#x53C2;&#x6570;</li>
<li>DMA&#x63A7;&#x5236;&#x5668;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4F20;&#x8F93;</li>
<li>DMA&#x63A7;&#x5236;&#x5668;&#x5411;&#x5904;&#x7406;&#x5668;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x4E2D;&#x65AD;&#xFF0C;&#x901A;&#x77E5;&#x5904;&#x7406;&#x5668;&#x6570;&#x636E;&#x4F20;&#x9001;&#x7684;&#x7ED3;&#x679C;</li>
<li>&#x5904;&#x7406;&#x5668;&#x5B8C;&#x6210;&#x672C;&#x6B21;DMA&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x65B0;&#x7684;DMA&#x8BF7;&#x6C42;</li>
</ul>
</li>
</ul>
</blockquote>
<h3 id="&#x5185;&#x5B58;&#x603B;&#x7EBF;&#x63A5;&#x53E3;">&#x5185;&#x5B58;&#x603B;&#x7EBF;&#x63A5;&#x53E3;</h3>
<ul>
<li>&#x7ED9;&#x5B9A;&#x4E00;&#x6BB5;DRAM&#x603B;&#x7EBF;&#x6CE2;&#x5F62;&#x56FE;&#xFF0C;&#x7ED9;&#x51FA;DRAM&#x8BBF;&#x95EE;&#x7684;&#x8BFB;&#x5199;&#x5730;&#x5740;(&#x8981;&#x6C42;&#x719F;&#x6089;DRAM&#x603B;&#x7EBF;&#x5404;&#x4FE1;&#x53F7;)</li>
</ul>
<h3 id="axi&#x603B;&#x7EBF;&#x63A5;&#x53E3;">AXI&#x603B;&#x7EBF;&#x63A5;&#x53E3;</h3>
<ul>
<li>&#x7528;Verilog&#x5199;&#x51FA;AXI&#x63A5;&#x53E3;&#x7684;RAM&#xFF08;&#x7ED9;&#x51FA;AXI&#x5173;&#x952E;&#x4FE1;&#x53F7;&#xFF09;
<img src="pic/AXIQA.png" alt=""></li>
</ul>
<h3 id="&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6570;&#x636E;&#x683C;&#x5F0F;">&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6570;&#x636E;&#x683C;&#x5F0F;</h3>
<ul>
<li>&#x5B9A;&#x70B9;&#x8865;&#x7801;&#x3001;&#x539F;&#x7801;&#x683C;&#x5F0F;</li>
<li>&#x6D6E;&#x70B9;&#x683C;&#x5F0F;
<img src="pic/IEEEQA.png" alt=""></li>
</ul>
<h3 id="&#x8BFB;&#x61C2;cmos&#x7535;&#x8DEF;">&#x8BFB;&#x61C2;CMOS&#x7535;&#x8DEF;</h3>
<ul>
<li>&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x6676;&#x4F53;&#x7BA1;&#x7535;&#x8DEF;&#xFF0C;&#x7ED9;&#x51FA;&#x771F;&#x503C;&#x8868;&#x548C;&#x7B49;&#x4EF7;&#x7684;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;
<img src="pic/CMOSQA.png" alt=""></li>
</ul>
<h3 id="&#x5148;&#x884C;&#x8FDB;&#x4F4D;&#x52A0;&#x6CD5;&#x5668;">&#x5148;&#x884C;&#x8FDB;&#x4F4D;&#x52A0;&#x6CD5;&#x5668;</h3>
<ul>
<li>&#x7528;Verilog&#x5199;&#x51FA;&#x6307;&#x5B9A;&#x4F4D;&#x6570;&#x7684;&#x5148;&#x884C;&#x8FDB;&#x4F4D;&#x52A0;&#x6CD5;&#x5668;&#xFF0C;&#x6216;&#x753B;&#x6307;&#x5B9A;&#x4F4D;&#x6570;&#x7684;&#x52A0;&#x6CD5;&#x5668;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x7ED9;&#x51FA;&#x6700;&#x957F;&#x5EF6;&#x8FDF;(&#x95E8;&#x7684;&#x7EA7;&#x6570;)
<img src="pic/&#x5148;&#x884C;&#x8FDB;&#x4F4D;QA.png" alt=""></li>
</ul>
<h3 id="&#x5B9A;&#x70B9;&#x8865;&#x7801;&#x4E58;&#x6CD5;&#x5668;-booth&#x7F16;&#x7801;&#x548C;&#x534E;&#x83B1;&#x58EB;&#x6811;">&#x5B9A;&#x70B9;&#x8865;&#x7801;&#x4E58;&#x6CD5;&#x5668;: Booth&#x7F16;&#x7801;&#x548C;&#x534E;&#x83B1;&#x58EB;&#x6811;</h3>
<ul>
<li>&#x7ED9;&#x51FA;&#x6307;&#x5B9A;&#x4E2A;&#x6570;&#x76F8;&#x52A0;&#x7684;&#x534E;&#x83B1;&#x58EB;&#x6811;&#x7684;&#x6700;&#x5C0F;&#x5C42;&#x6570;&#x3001;&#x5229;&#x7528;&#x534A;&#x52A0;&#x5668;&#x80FD;&#x589E;&#x52A0;&#x591A;&#x5C11;&#x8FDB;&#x4F4D;(&#x4E0D;&#x6539;&#x52A8;&#x5168;&#x52A0;&#x5668;&#x548C;&#x6539;&#x52A8;&#x5168;&#x52A0;&#x5668;)
<img src="pic/&#x534E;&#x83B1;&#x58EB;&#x6811;.png" alt="">
<img src="pic/&#x534E;&#x83B1;&#x58EB;&#x6811;2.png" alt=""></li>
</ul>
<h3 id="&#x6307;&#x4EE4;&#x6D41;&#x6C34;&#x7EBF;">&#x6307;&#x4EE4;&#x6D41;&#x6C34;&#x7EBF;</h3>
<ul>
<li>&#x7ED9;&#x51FA;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#xFF0C;&#x8981;&#x6C42;&#x753B;&#x51FA;&#x4E94;&#x7EA7;&#x9759;&#x6001;&#x6D41;&#x6C34;&#x7EBF;&#x65F6;&#x7A7A;&#x56FE;(&#x53EF;&#x8981;&#x6C42;&#x6307;&#x51FA;&#x963B;&#x585E;&#x539F;&#x56E0;)&#xFF0C;&#x5F15;&#x5165;&#x524D;&#x9012;&#x3001;&#x63D0;&#x524D;&#x8BA1;&#x7B97;&#x8DF3;&#x8F6C;&#x5730;&#x5740;&#x7B49;&#x673A;&#x5236;&#x540E;&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#x65F6;&#x7A7A;&#x56FE;</li>
</ul>
<h3 id="&#x8F6C;&#x79FB;&#x731C;&#x6D4B;">&#x8F6C;&#x79FB;&#x731C;&#x6D4B;</h3>
<ul>
<li>&#x7ED3;&#x5408;&#x8F6C;&#x79FB;&#x731C;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x4E00;&#x6BB5;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x547D;&#x4E2D;&#x7387;
<img src="pic/BHTQ.png" alt="">
<img src="pic/BHTA1.png" alt="">
<img src="pic/BHTA2.png" alt="">
<img src="pic/BHTA3.png" alt=""></li>
</ul>
<h3 id="cache&#x7ED3;&#x6784;">Cache&#x7ED3;&#x6784;</h3>
<ul>
<li>&#x8BBF;&#x5B58;&#x5730;&#x5740;&#x4E2D;Tag&#x3001;index&#x3001;offset&#x4E0E;Cache&#x7ED3;&#x6784;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;
<img src="pic/CacheQ.png" alt="">
<img src="pic/CacheA.png" alt=""></li>
</ul>
<h3 id="pthread&#x3001;openmp&#x3001;mpi&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#xFF0C;amdahl&#x5B9A;&#x5F8B;">Pthread&#x3001;OpenMP&#x3001;MPI&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#xFF0C;Amdahl&#x5B9A;&#x5F8B;</h3>
<ul>
<li>&#x7ED3;&#x5408;Amdahl&#x5B9A;&#x5F8B;&#xFF0C;&#x8BA1;&#x7B97;&#x4E00;&#x6BB5;OpenMP&#x7A0B;&#x5E8F;&#x7684;&#x52A0;&#x901F;&#x6BD4;</li>
</ul>
<h3 id="&#x539F;&#x5B50;&#x6307;&#x4EE4;&#x3001;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#x3001;&#x81EA;&#x65CB;&#x9501;">&#x539F;&#x5B50;&#x6307;&#x4EE4;&#x3001;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#x3001;&#x81EA;&#x65CB;&#x9501;</h3>
<ul>
<li>&#x5229;&#x7528;LL/SC&#x6307;&#x4EE4;&#x5B9E;&#x73B0;&#x9501;
<img src="pic/LL-SCQA.png" alt=""></li>
</ul>
<h3 id="cache&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;">Cache&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;</h3>
<ul>
<li>&#x76EE;&#x5F55;&#x5199;&#x65E0;&#x6548;&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;Cache&#x4E00;&#x81F4;&#x6027;&#x884C;&#x4E3A;
<img src="pic/ESI1.png" alt="">
<img src="pic/ESI2.png" alt="">
<img src="pic/ESI3.png" alt=""></li>
</ul>
<h3 id="&#x6027;&#x80FD;&#x6BD4;&#x8F83;&#x5206;&#x6790;">&#x6027;&#x80FD;&#x6BD4;&#x8F83;&#x5206;&#x6790;</h3>
<ul>
<li>&#x8BA1;&#x7B97;&#x4E0D;&#x540C;&#x8BA1;&#x7B97;&#x673A;&#x7684;MIPS&#x548C;IPC&#xFF0C;&#x5E76;&#x6BD4;&#x8F83;&#x4E0D;&#x540C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6027;&#x80FD;</li>
<li>&#x4E86;&#x89E3;perf&#x7684;&#x7B80;&#x5355;&#x4F7F;&#x7528;</li>
<li>&#x5206;&#x6790;EEMBC&#x548C;SPEC CPU2000&#x884C;&#x4E3A;&#x7279;&#x6027;&#x4E0A;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x522B;?</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="12ji-suan-ji-xing-neng-fen-xi.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 12计算机性能分析">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"重点能力","level":"1.14","depth":1,"previous":{"title":"12计算机性能分析","level":"1.13","depth":1,"path":"12ji-suan-ji-xing-neng-fen-xi.md","ref":"12ji-suan-ji-xing-neng-fen-xi.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"zhong-dian-neng-li.md","mtime":"2024-01-09T04:39:21.114Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-01-09T04:39:29.842Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

